import 'dart:developer';

import 'package:flutter/foundation.dart';

void errorLog(
  dynamic e, {
  String source = "",
  String title = "",
}) {


  try {
    if (kDebugMode) {
      log(""""
      >>>>>>>>>>>>>>>>>>>>>>>>>>>😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
          
          $source

      >>>>>>>>>>>>>>>>>>>>>>>>>>>😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


     ➡️➡️➡️➡️➡️$title:========>  ${e.toString()} 🔚🔚🔚🔚🔚🔚🔚🔚
      

      <<<<<<<<<<<<<<<<<<<<<<<<<<<😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
      """);
    }
  } catch (e) {
    ///////
  }
}
